**HANDLING MISSING DATA**

In [ ]:
import pandas as pd
import numpy as np

data={
    "Name":["ALICE","BOB","CHARLIE","ARCAMIDE"],
    "Age":[23,24,55,12],
    "Salary":[10000,20000,43000,55000]
}
dataframe=pd.DataFrame(data)
print(dataframe)

       Name  Age  Salary
0     ALICE   23   10000
1       BOB   24   20000
2   CHARLIE   55   43000
3  ARCAMIDE   12   55000

In [ ]:
print(dataframe.isna())

    Name    Age  Salary
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False

In [ ]:
data_clean=dataframe.dropna()
print(data_clean)

       Name  Age  Salary
0     ALICE   23   10000
1       BOB   24   20000
2   CHARLIE   55   43000
3  ARCAMIDE   12   55000

In [ ]:
data_clean=dataframe.dropna(axis=1)
print(data_clean)

       Name  Age  Salary
0     ALICE   23   10000
1       BOB   24   20000
2   CHARLIE   55   43000
3  ARCAMIDE   12   55000

**FILL Na**
* fillna(value): It will replace missing values
* fillna(method='ffill'):Forwardfill.It will fill the values from previous value
* fillna(method='bfill'):Backwardfill.It will fill values from next row

In [ ]:
data_filled=dataframe.fillna({'Age':dataframe['Age'].mean(),'Salary':0})
print("DataFrame:",dataframe)
print(data_filled)

DataFrame:        Name  Age  Salary
0     ALICE   23   10000
1       BOB   24   20000
2   CHARLIE   55   43000
3  ARCAMIDE   12   55000
       Name  Age  Salary
0     ALICE   23   10000
1       BOB   24   20000
2   CHARLIE   55   43000
3  ARCAMIDE   12   55000

In [ ]:
data_filled=dataframe.fillna(method='ffill')
print(data_filled)

       Name  Age  Salary
0     ALICE   23   10000
1       BOB   24   20000
2   CHARLIE   55   43000
3  ARCAMIDE   12   55000

<ipython-input-6-f3980fc6a4a9>:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data_filled=dataframe.fillna(method='ffill')

In [ ]:
data_filled=dataframe.bfill()
print(data_filled)

       Name  Age  Salary
0     ALICE   23   10000
1       BOB   24   20000
2   CHARLIE   55   43000
3  ARCAMIDE   12   55000

**INTERPOLATION**

In [ ]:
data_interpolated=dataframe.infer_objects(copy=False)
print(data_interpolated)

       Name  Age  Salary
0     ALICE   23   10000
1       BOB   24   20000
2   CHARLIE   55   43000
3  ARCAMIDE   12   55000

In [ ]:
print(dataframe.isna().sum())

Name      0
Age       0
Salary    0
dtype: int64

**TENSORFLOW**
Tensor: Multidimensional array
Data gathering: Collect Data
Data cleansing: Scaling, Normalisation, Unnecessary Data
Optimization

1. Model: Neural Network
2. Compile
3. Fit: Train
4. Optimize
5. Predict

Image Collection=>Vectorized Operation Cleansing=>Remove Unnecessary Data=>Labelled Data=>Neural Network=>Train=>Prediction

In [4]:
import pandas as pd
data=pd.read_csv('/content/city_temperature.csv')

print(data)

<ipython-input-4-db7fd60bab6c>:2: DtypeWarning: Columns (2) have mixed types. Specify dtype option on import or set low_memory=False.
  data=pd.read_csv('/content/city_temperature.csv')

                Region  Country                   State                  City  \
0               Africa  Algeria                     NaN               Algiers
1               Africa  Algeria                     NaN               Algiers
2               Africa  Algeria                     NaN               Algiers
3               Africa  Algeria                     NaN               Algiers
4               Africa  Algeria                     NaN               Algiers
...                ...      ...                     ...                   ...
2906322  North America       US  Additional Territories  San Juan Puerto Rico
2906323  North America       US  Additional Territories  San Juan Puerto Rico
2906324  North America       US  Additional Territories  San Juan Puerto Rico
2906325  North America       US  Additional Territories  San Juan Puerto Rico
2906326  North America       US  Additional Territories  San Juan Puerto Rico

         Month  Day  Year  AvgTemperature
0            1    1  1995            64.2
1            1    2  1995            49.4
2            1    3  1995            48.8
3            1    4  1995            46.4
4            1    5  1995            47.9
...        ...  ...   ...             ...
2906322      7   27  2013            82.4
2906323      7   28  2013            81.6
2906324      7   29  2013            84.2
2906325      7   30  2013            83.8
2906326      7   31  2013            83.6

[2906327 rows x 8 columns]